<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Nrengine-stunts] [STORY] Ein paar Ideen
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/nrengine-stunts/2005-April/index.html" >
   <LINK REL="made" HREF="mailto:nrengine-stunts%40lists.berlios.de?Subject=Re%3A%20%5BNrengine-stunts%5D%20%5BSTORY%5D%20Ein%20paar%20Ideen&In-Reply-To=%3C64024895050420134261e9e734%40mail.gmail.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   
   <LINK REL="Next"  HREF="000001.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Nrengine-stunts] [STORY] Ein paar Ideen</H1>
    <B>Kai Uwe Hagenburg</B> 
    <A HREF="mailto:nrengine-stunts%40lists.berlios.de?Subject=Re%3A%20%5BNrengine-stunts%5D%20%5BSTORY%5D%20Ein%20paar%20Ideen&In-Reply-To=%3C64024895050420134261e9e734%40mail.gmail.com%3E"
       TITLE="[Nrengine-stunts] [STORY] Ein paar Ideen">kai.hagenburg at gmail.com
       </A><BR>
    <I>Wed Apr 20 22:42:47 CEST 2005</I>
    <P><UL>
        
        <LI>Next message: <A HREF="000001.html">[Nrengine-stunts] [PHYSICS] some links
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#0">[ date ]</a>
              <a href="thread.html#0">[ thread ]</a>
              <a href="subject.html#0">[ subject ]</a>
              <a href="author.html#0">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo, 
ich habe mir mal ein paar Ideen gemacht &#252;ber das Grundkonzept des
Spiels. Zuerst mal ein paar grundlegende Szenen, die ich gestern nach
der Uni auf der Heimfahrt zusammen mit Markus besprochen habe. Danach
ein paar grundlegende Ideen f&#252;r Spielmodi, etc... und halt eben ein
erster Storyvorschlag....




Stunts 2005


Ideenliste:

-	Szene: Br&#252;cke (&#228;hnlich Golden Gate Bridge etc&#8230;), die halb zerst&#246;rt
ist, mit einigen Hindernissen (z.B. stehengebliebener LKW, Bus, Zug,
etc., &#228;hnlich der Eisenbahnbr&#252;cke bei HL2).
o	Br&#252;cke hat ausserdem L&#246;cher und vor diesen befinden sich
Sprungschanzen. Bei diesen Spr&#252;ngen muss man auf den Seitenwind
achten. D.h. wenn man springt, sollte man ein wenig gegensteuern, wenn
man an dem gr&#246;&#223;eren Hindernis vorbeif&#228;hrt, ver&#228;ndert sich f&#252;r einen
Moment das Fahrgef&#252;hl.
o	Eines der Spannseile ist gerissen
-	Szene: Durch etwas durchbrechen. Z.B. gro&#223;en, riesigen Vorhang,
aufgestapelte Kisten, etc&#8230;
-	Szene: b&#246;ses Tal: Man f&#228;hrt in ein Tal, in dem sich eine Nebelsuppe
gebildet hat. Dort befinden sich ein paar Fallen.


Damit verbunden:
-	Windsimulation
-	Fahrphysik abh&#228;ngig von Wind
-	Einbringen des Tanks: Je voller der Tank, desto schwerer der Wagen,
desto langsamer.
-	Schadensmodell, Reperaturbedarf, Motorhaltbarkeit, Reifen,
Windschatten., verschiedene Oberfl&#228;chenbel&#228;ge (Strasse, Sand, Grass&#8230;),
Sandaufwirbelungen, etc&#8230;



Spielmodi:
-	Rundrennen (gegen mehrere Gegner)
-	Zeitrennen (einfaches Rennen, wer als schnellstes eine Strecke gefahren ist)
-	Stunt Deluxe (viele Stunts)
-	Hell on Wheels (Erkundungsrennen, in dem es sehr viele Fallen gibt)
-	Verfolgungsjagd / Storymissionen (vielleicht als Verbund zwischen
den Strecken)


Story:
Tutorialmissionen, sollen auf die einzelnen Spielmodi vorbereiten


San Francisco 2009
Tom &#8222;TomCat&quot; Sutherland ist ein gefragter, weltbekannter Rennfahrer,
der bekannt ist f&#252;r seine waghalsigen Man&#246;ver. W&#228;hrend er sich
normalerweise alle paar Wochen in seinen Bolliden sitzt, um in der
Formel Stunt sein Geld und seinen Ruhm zu verdienen, lebt daheim seine
Frau Julie und seine kleine Tochter Kim.
Der erste Teil sollte dazu dienen, den Charakter und sein Umfeld dem
Spieler zu zeigen und auch die Spielmodi des Spiels zu zeigen.

10 Jahre sp&#228;ter&#8230;
Aufgrund einer nuklearen Katastrophe (ein Al-Kaida-Trojaner hat die
Firewalls der Sicherheitssysteme von Kernkraftwerken gehackt und dann
alle Reaktoren zum Schmelzen gebracht, oder irgendsowas in der
Richtung halt &#61514;) ist die komplette Westk&#252;ste abgeriegelt und zur
Todeszone erkl&#228;rt worden (mal wieder *g*, Mad Max f&#252;r Arme halt). Tom
Sutherland war zu dem Zeitpunkt des Ungl&#252;cks nicht in dem
Ungl&#252;cksgebiet, aber daf&#252;r seine Tochter, die schwere
Strahlenverletzungen bekommen hat. Leider hat Tom nicht viel Geld, um
ihr die n&#246;tigen Operationen und Kuren zu bezahlen, deshalb l&#228;sst er
sich auf die sogenannten &#8222;Hell Stunts&quot; ein. Dieses ist eine Art
Wanderzirkus, der Rennen in der Todeszone veranstaltet. Diese werden
per Hubschrauber-Cam augezeichnet und weltweit ausgestrahlt (Irgendwie
muss man das ja auch erkl&#228;ren &#61514;).  Nach jedem Rennen kann man ein
Preisgeld abstauben. Zus&#228;tzlich gibt es noch zus&#228;tzliche Preisgelder
f&#252;r besonders schnell gefahrene Missionen oder besonders waghalsige
Stunts. Nach jedem Rennen, besteht die M&#246;glichkeit, an Tankstellen
oder Werkst&#228;tten zu fahren, um dort zu tanken, irgendwelche Teile zu
reparieren oder das Auto zu tunen mit Nitro, Nos, oder was weiss ich
f&#252;r Dinge. Also kein Tuningprofil wie bei NFS:U, wo man einfach nur
tunt, der Optik wegen, sondern daf&#252;r, dass man gewinnt. Ideen f&#252;r
weiter Tools w&#228;ren zum Beispiel Dinge, um das Auto robuster zu machen
oder irgendwelche &#8222;Waffen&quot;, um Gegner zur&#252;ckzuwerfen, z.B. Spikes an
den Reifen, wenn man im &#8222;Nahkampf&quot; dem Gegner die Reifen aufschlitzen
will, oder z.B. Nadeln, die man auf die Fahrbahn hinten raus wirft.
Ziel des Spiels ist es dann, den Hells Drivers Cup zu erlangen.
Ausserdem gibt es noch die M&#246;glichkeit, einzelne Unterpreise zu
gewinnen (&#228;hnlich dem gr&#252;nen Trikot bei der Tour de France f&#252;r den
besten Bergfahrer).
Ne weitere Idee w&#228;re es, marodierende Gruppen in das Spiel zu bringen,
die versuchen das Rennen zu ver&#228;ndern (als kleine Referenz: die Jawas
in Episode 1, die versuchen einzelne POD-Racer abzuschie&#223;en, um dann
deren Metallreste nach dem Crash aufzusammeln)

Globales Design in den Anfangstutorials:
Die Texturen sollten sehr hell und sehr farbenfroh sein, die Modelle
sehr detailreich und so, als k&#228;men sie gerade vom Band.

Globales Design im Hauptspiel:
Farbton-Skala im Bereich von einem sandigen Gelb-Orange-Ton bis zu
dunkelnen Braun- und Rott&#246;nen. Die Autos sollen sehr verbraucht
aussehen, wie ein Flickenteppich. Es soll so aussehen, dass sie unter
Zeitdruck und mit primitivsten Materialien geflickt worden seien. Die
Umgebung sollte keine pure W&#252;stenlandschaft sein, sondern etwas
abwechselungsreich. Zum Beispiel Felsencanyons, Br&#252;cken &#252;ber leere
Flussbette, zerfallene Metropolen.


Vorteil des Szenarios:
- Man kann mehr oder weniger ohne st&#246;renden Gegenverkehr fahren

Nachteil des Szenarios:
- M&#246;glichkeit, dass die Umgebung auf Dauer zu eint&#246;nig werden kann
(kann man aber durch Farbvariationen &#228;ndern)



Dies alles sind nur mal ein paar Ideen, die ich so hatte f&#252;r das
globale Design, bin offen f&#252;r Vorschl&#228;ge und andere Ideen :)
Euer Kai

P.S. sollten wir auf deutsch oder auf englisch schreiben?

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	
	<LI>Next message: <A HREF="000001.html">[Nrengine-stunts] [PHYSICS] some links
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#0">[ date ]</a>
              <a href="thread.html#0">[ thread ]</a>
              <a href="subject.html#0">[ subject ]</a>
              <a href="author.html#0">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/nrengine-stunts">More information about the Nrengine-stunts
mailing list</a><br>
</body></html>
